// Какви функции съдържа следният клас ?
//
class Foo
{
};

// а) Конструткор по поразбиране , конструктор за копиране, 
//    оператор за присвояване, деструктор
// б) Този клас няма никакви функции
// в) Конструткор по поразбиране и деструктор
// г) Конструткор по поразбиране и конструктор за копиране
// ---------------------------------------------------------
// Кои функции са общи за следните два класа ?
class Bar
{
public:
	Bar(int a){}
private:
	int a;
};

class Chunky
{
};

// a) конструктор за копиране и оператор за присвояване
// б) оператор за присвояване и  деструктор
// в) конструктор за копиране, оператор за присвояване и деструктор
// г) конструктор за копиране и  деструктор
// ---------------------------------------------------------
// Кое от следните твърдения НЕ Е вярно за деструкторите
// а) Могат да бъдат извикани явно от потребителят
// б) Извикват се когато един обект излезе извън областта си на видимост
// в) Извикваа се когато обект е динамично създаден и излезе извън областта си на видимост
// г) Грижи се освобождаване на придобит ресурс
// ---------------------------------------------------------
// Каква е разликата между структура и клас в С++
// а) Няма разлика, ключови думи синоними са
// б) В класовете достъп по подразбиране на полетата е public, докато при структурите е private
// в) В класовете достъп по подразбиране на полетата е private, докато при структурите е public
// г) В структурите не може да имаме функции
// ---------------------------------------------------------
// Кое от следните твърдения е вярно за структурите в С++
// а) В структура не може да имаме функции
// б) Структури не могат да се наследяват
// в) В структурите достъп по подразбиране на полетата е public
// г) В структурите достъп по подразбиране на полетата е private
// ---------------------------------------------------------
// ---------------------------------------------------------
// Koe от следните твърдения е вярно за динамична памет заделена с оператор new
// а) Динамична памет заделена с операторa new[] може да бъде освободена само с операторa delete
// б) Може да освободим два пъти една и съща памет
// в) Ако загубим адресът на динамично заделената памет ще имам загуба на памет
// г) Когато излезе извън зоната си на видимост всеки указател сочещ към динамично заделена памет освобождава автоматично
// ---------------------------------------------------------

struct point
{
	int x, y;
};
//1 point p1 = point();
//2 point p2;
//3 p2 = p1
// Кои са функциите коите се изпълняват на ред 1, 2 и 3
// а) Конструктор за копиране, конструктор по подразбиране и оператор за присвояване
// б) конструктор по подразбиране, конструктор за копиране, конструктор по подразбиране и оператор за присвояване
// в) конструктор по подразбиране, конструктор по подразбиране и оператор за присвояване
// г) конструктор по подразбиране, конструктор по подразбиране и оператор за присвояване

int main()
{
	return 0;
}
